#+title: Doom Emacs Configuration

** Fonts Setup
Doom exposes five (optional) variables for controlling fonts in Doom. Here are the three important ones:
- `doom-font'
- `doom-variable-pitch-font'
- `doom-big-font' -- used for `doom-big-font-mode'; use this for presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd font string. You generally only need these two:

#+begin_src emacs-lisp
(defun my/toolbar-on-off ()
  (tool-bar-mode 1)
  (tool-bar-mode 0))

(add-hook 'doom-after-init-hook (lambda () (my/toolbar-on-off)))

(setq doom-font (font-spec :family "JetBrains Mono Light 1.3" :size 14 :style "ExtraLight" :weight 'normal :height 140)
      doom-variable-pitch-font (font-spec :family "Roboto" :style "Light" :size 12 :weight 'normal)
      doom-big-font (font-spec :family "Roboto" :style "Medium" :size 32 :weight 'normal)
      doom-serif-font (font-spec :family "JetBrains Mono Light 1.3" :size 14 :style "ExtraLight" :weight 'normal :height 140))

(setq-default left-margin-width 1)
(set-window-buffer nil (current-buffer))

(defun special-buffer-mode-font()
  "Set custom font for special mode"
  (interactive)
  (setq buffer-face-mode-face '(:family "Roboto" :height 130))
  (buffer-face-mode t))

(defun org-mode-buffer-font()
  "Set custom font for ORG mode"
  (interactive)
  (setq buffer-face-mode-face '(:family "JetBrains Mono Thin" :height 110))
  (buffer-face-mode t))

(defun special-buffer-mode-mono-font()
  "Set custom monospace font for special mode"
  (interactive)
  (setq buffer-face-mode-face '(:family "JetBrains Mono Thin" :height 100))
  (buffer-face-mode t))

(add-to-list 'default-frame-alist '(height . 30))
(add-to-list 'default-frame-alist '(width . 180))
(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))
#+end_src

#+RESULTS:
: ((tool-bar-lines . 0) (buffer-predicate . doom-buffer-frame-predicate) (right-divider-width . 1) (bottom-divider-width . 1) (cursor-color . #908caa) (background-color . #232136) (foreground-color . #e0def4) (ns-appearance . dark) (ns-transparent-titlebar . t) (width . 180) (height . 30) (vertical-scroll-bars) (menu-bar-lines . tty) (left-fringe . 8) (right-fringe . 8))

** Statusline Setup

Setup for the doom-modeline.

#+begin_src emacs-lisp
(use-package! doom-modeline
  :ensure t
  :config
  (setq evil-normal-state-tag (propertize "[N]")
        evil-insert-state-tag (propertize "[I]")
        evil-visual-state-tag (propertize "[V]")
        evil-replace-state-tag (propertize "[R]")
        evil-emacs-state-tag (propertize "[E]")
        evil-operator-state-tag (propertize "[O]")
        evil-motion-state-tag (propertize "[M]"))
  (setq doom-modeline-hud t)
  (setq doom-modeline-icon t)
  (setq doom-modeline-major-mode-icon t)
  (setq doom-modeline-modal-icon nil)
  (setq doom-modeline-lsp-icon nil)
  (setq doom-modeline-buffer-modification-icon nil)
  (setq doom-modeline-buffer-state-icon nil)
  (setq doom-modeline-persp-name t)
  (setq doom-modeline-height 40)
  (setq doom-modeline-bar-width 5)
  (setq nerd-icons-scale-factor 1.1)
  (setq doom-modeline-max-length 40)
  (setq doom-modeline-vcs-max-length 100)
  (setq doom-modeline-check-simple-format t))

(after! doom-modeline
  (add-hook 'doom-init-ui-hook
            (lambda ()
              (custom-set-faces
               '(mode-line ((t (:family "JetBrains Mono Light 1.3" :height 0.9 :background "FF"))))
               '(mode-line-active ((t (:family "JetBrains Mono Light 1.3" :height 0.9 :background "FF"))))
               '(mode-line-inactive ((t (:family "JetBrains Mono Light 1.3" :height 0.9 :background "FF"))))))))
#+end_src

#+RESULTS:
| (lambda nil (custom-set-faces '(mode-line ((t (:family JetBrains Mono :height 120 :background FF)))) '(mode-line-active ((t (:family JetBrains Mono :height 120 :background FF)))) '(mode-line-inactive ((t (:family JetBrains Mono :height 120 :background FF)))))) | persp-mode | window-divider-mode | +popup-mode |

